restaurant/app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("commenter", "content", "created_at", "shop_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "1"], ["content", "1"], ["created_at", Fri, 11 Apr 2014 02:04:35 UTC +00:00], ["shop_id", 1], ["updated_at", Fri, 11 Apr 2014 02:04:35 UTC +00:00]]

  def edit
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "3"]]

  def destroy
    @comment = Comment.find(params[:id])

    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]