restaurant/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "shops"
---
  def index
    @shops = Shop.paginate(:page => params[:page], :per_page => 1)

INSERT INTO "shops" ("address", "alone_table_count", "closing", "couple_table_count", "created_at", "do_card_pay", "do_drink", "do_parking", "is_coupon", "is_dessert", "is_off_shoes", "is_pre_pay", "is_selfservice", "is_special_menu", "is_takeout", "name", "operate_period", "phone_number", "public_transport_info", "room_count", "surrounding_info", "table_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shop = Shop.create(shop_params)

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @shop = Shop.find(params[:id])

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @shop = Shop.find(params[:id])

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "shops" SET "string" = ?, "text" = ?, "updated_at" = ? WHERE "shops"."id" = 1  [["string", "string"], ["text", "text"], ["updated_at", Fri, 11 Apr 2014 00:46:36 UTC +00:00]]
---
  def update
    @shop = Shop.find(params[:id])
    if @shop.update(shop_params)

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 1]]
---
  def destroy
    @shop = Shop.find(params[:id])
    @shop.destroy