restaurant/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "name", "password", "pw_confirm", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 11 Apr 2014 02:13:00 UTC +00:00], ["email", "그냥해봄@하하하"], ["name", "서울촌놈"], ["password", "123"], ["pw_confirm", "123"], ["updated_at", Fri, 11 Apr 2014 02:13:00 UTC +00:00]]