gooblog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "1"], ["content", "1"], ["created_at", Fri, 11 Apr 2014 15:41:59 UTC +00:00], ["post_id", 2], ["updated_at", Fri, 11 Apr 2014 15:41:59 UTC +00:00]]
---
  def create
    @comment = Comment.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @comment = Comment.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])

    @comment.destroy