gooblog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT 1
---
  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "11111"], ["created_at", Fri, 11 Apr 2014 15:40:49 UTC +00:00], ["title", "test1"], ["updated_at", Fri, 11 Apr 2014 15:40:49 UTC +00:00]]
---
  def create
    @post = Post.create(post_params)