gooblog/app/views/posts/_rail.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT 1
---

<% if Post.last %>

SELECT "comments".* FROM "comments" ORDER BY "comments"."id" DESC LIMIT 1
---
<% end %>
<% if Comment.last %>